
convlstm2d start at:2020-05-04 16:31:58.288622
Model: "convlstm2d"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 32, 20, 1, 1)      0         
_________________________________________________________________
batch_norm_0 (BatchNormaliza (None, 32, 20, 1, 1)      4         
_________________________________________________________________
conv_lstm_1 (ConvLSTM2D)     (None, 32, 20, 1, 64)     166656    
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 20, 1, 64)     0         
_________________________________________________________________
batch_norm_1 (BatchNormaliza (None, 32, 20, 1, 64)     256       
_________________________________________________________________
conv_lstm_2 (ConvLSTM2D)     (None, 20, 1, 64)         164096    
_________________________________________________________________
dropout_2 (Dropout)          (None, 20, 1, 64)         0         
_________________________________________________________________
batch_norm_2 (BatchNormaliza (None, 20, 1, 64)         256       
_________________________________________________________________
flatten_1 (Flatten)          (None, 1280)              0         
_________________________________________________________________
repeat_vector_1 (RepeatVecto (None, 1, 1280)           0         
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 20, 1, 64)      0         
_________________________________________________________________
conv_lstm_3 (ConvLSTM2D)     (None, 1, 20, 1, 64)      327936    
_________________________________________________________________
dropout_3 (Dropout)          (None, 1, 20, 1, 64)      0         
_________________________________________________________________
batch_norm_3 (BatchNormaliza (None, 1, 20, 1, 64)      256       
_________________________________________________________________
conv_lstm_4 (ConvLSTM2D)     (None, 1, 20, 1, 64)      164096    
_________________________________________________________________
time_distributed_1 (TimeDist (None, 1, 20, 1, 1)       65        
_________________________________________________________________
flatten_2 (Flatten)          (None, 20)                0         
=================================================================
Total params: 823,621
Trainable params: 823,235
Non-trainable params: 386
_________________________________________________________________

convlstm2d start at:2020-05-04 16:32:59.088809
Model: "convlstm2d"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 32, 20, 1, 1)      0         
_________________________________________________________________
batch_norm_0 (BatchNormaliza (None, 32, 20, 1, 1)      4         
_________________________________________________________________
conv_lstm_1 (ConvLSTM2D)     (None, 32, 20, 1, 64)     166656    
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 20, 1, 64)     0         
_________________________________________________________________
batch_norm_1 (BatchNormaliza (None, 32, 20, 1, 64)     256       
_________________________________________________________________
conv_lstm_2 (ConvLSTM2D)     (None, 20, 1, 64)         164096    
_________________________________________________________________
dropout_2 (Dropout)          (None, 20, 1, 64)         0         
_________________________________________________________________
batch_norm_2 (BatchNormaliza (None, 20, 1, 64)         256       
_________________________________________________________________
flatten_1 (Flatten)          (None, 1280)              0         
_________________________________________________________________
repeat_vector_1 (RepeatVecto (None, 1, 1280)           0         
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 20, 1, 64)      0         
_________________________________________________________________
conv_lstm_3 (ConvLSTM2D)     (None, 1, 20, 1, 64)      327936    
_________________________________________________________________
dropout_3 (Dropout)          (None, 1, 20, 1, 64)      0         
_________________________________________________________________
batch_norm_3 (BatchNormaliza (None, 1, 20, 1, 64)      256       
_________________________________________________________________
conv_lstm_4 (ConvLSTM2D)     (None, 1, 20, 1, 64)      164096    
_________________________________________________________________
time_distributed_1 (TimeDist (None, 1, 20, 1, 1)       65        
_________________________________________________________________
flatten_2 (Flatten)          (None, 20)                0         
=================================================================
Total params: 823,621
Trainable params: 823,235
Non-trainable params: 386
_________________________________________________________________

convlstm2d start at:2020-05-04 16:36:03.605943
Model: "convlstm2d"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 32, 20, 1, 1)      0         
_________________________________________________________________
batch_norm_0 (BatchNormaliza (None, 32, 20, 1, 1)      4         
_________________________________________________________________
conv_lstm_1 (ConvLSTM2D)     (None, 32, 20, 1, 64)     166656    
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 20, 1, 64)     0         
_________________________________________________________________
batch_norm_1 (BatchNormaliza (None, 32, 20, 1, 64)     256       
_________________________________________________________________
conv_lstm_2 (ConvLSTM2D)     (None, 20, 1, 64)         164096    
_________________________________________________________________
dropout_2 (Dropout)          (None, 20, 1, 64)         0         
_________________________________________________________________
batch_norm_2 (BatchNormaliza (None, 20, 1, 64)         256       
_________________________________________________________________
flatten_1 (Flatten)          (None, 1280)              0         
_________________________________________________________________
repeat_vector_1 (RepeatVecto (None, 1, 1280)           0         
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 20, 1, 64)      0         
_________________________________________________________________
conv_lstm_3 (ConvLSTM2D)     (None, 1, 20, 1, 64)      327936    
_________________________________________________________________
dropout_3 (Dropout)          (None, 1, 20, 1, 64)      0         
_________________________________________________________________
batch_norm_3 (BatchNormaliza (None, 1, 20, 1, 64)      256       
_________________________________________________________________
conv_lstm_4 (ConvLSTM2D)     (None, 1, 20, 1, 64)      164096    
_________________________________________________________________
time_distributed_1 (TimeDist (None, 1, 20, 1, 1)       65        
_________________________________________________________________
flatten_2 (Flatten)          (None, 20)                0         
=================================================================
Total params: 823,621
Trainable params: 823,235
Non-trainable params: 386
_________________________________________________________________

convlstm2d start at:2020-05-04 16:36:37.373411
Model: "convlstm2d"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
reshape_1 (Reshape)          (None, 32, 20, 1, 1)      0         
_________________________________________________________________
batch_norm_0 (BatchNormaliza (None, 32, 20, 1, 1)      4         
_________________________________________________________________
conv_lstm_1 (ConvLSTM2D)     (None, 32, 20, 1, 64)     166656    
_________________________________________________________________
dropout_1 (Dropout)          (None, 32, 20, 1, 64)     0         
_________________________________________________________________
batch_norm_1 (BatchNormaliza (None, 32, 20, 1, 64)     256       
_________________________________________________________________
conv_lstm_2 (ConvLSTM2D)     (None, 20, 1, 64)         164096    
_________________________________________________________________
dropout_2 (Dropout)          (None, 20, 1, 64)         0         
_________________________________________________________________
batch_norm_2 (BatchNormaliza (None, 20, 1, 64)         256       
_________________________________________________________________
flatten_1 (Flatten)          (None, 1280)              0         
_________________________________________________________________
repeat_vector_1 (RepeatVecto (None, 1, 1280)           0         
_________________________________________________________________
reshape_2 (Reshape)          (None, 1, 20, 1, 64)      0         
_________________________________________________________________
conv_lstm_3 (ConvLSTM2D)     (None, 1, 20, 1, 64)      327936    
_________________________________________________________________
dropout_3 (Dropout)          (None, 1, 20, 1, 64)      0         
_________________________________________________________________
batch_norm_3 (BatchNormaliza (None, 1, 20, 1, 64)      256       
_________________________________________________________________
conv_lstm_4 (ConvLSTM2D)     (None, 1, 20, 1, 64)      164096    
_________________________________________________________________
time_distributed_1 (TimeDist (None, 1, 20, 1, 1)       65        
_________________________________________________________________
flatten_2 (Flatten)          (None, 20)                0         
=================================================================
Total params: 823,621
Trainable params: 823,235
Non-trainable params: 386
_________________________________________________________________
Time consumed:0:09:37.933907
convlstm2d mse: 2931.016685191759
convlstm2d mae: 43.44365051412009


